Revit 2026 API

# ColorFillSchemeEntry Class

---

Represents an entry of a [!:Autodesk::Revit::DB::ColorFillScheme].

SystemObject Autodesk.Revit.DBColorFillSchemeEntry

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ColorFillSchemeEntry : IDisposable
```
```vb
Public Class ColorFillSchemeEntry
	Implements IDisposable
```
```cpp
public ref class ColorFillSchemeEntry : IDisposable
```
```fsharp
type ColorFillSchemeEntry =
    class
        interface IDisposable
    end
```

The ColorFillSchemeEntry type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ColorFillSchemeEntry | Creates new ColorFillSchemeEntry. |

|  | Name | Description |
| --- | --- | --- |
|  | Caption | The text displayed in [!:Autodesk::Revit::DB::ColorFillLegend] for this entry. |
|  | Color | The filling color of this entry. |
|  | FillPatternId | The id of fill pattern element of this entry. |
|  | IsInUse | Represents if there exists at least one element colored based on this entry in the document. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | IsVisible | Represents if the element colored based on this entry is visible in views. |
|  | StorageType | The storage type of the value stored in this entry. |

|  | Name | Description |
| --- | --- | --- |
|  | CanSetValue(Double) | Checks whether StorageType of entry is Double and the value is no less than 0.0. |
|  | CanSetValue(ElementId) | Checks whether StorageType of entry is ElementId. |
|  | CanSetValue(Int32) | Checks whether StorageType of entry is Integer. |
|  | Dispose | Releases all resources used by the ColorFillSchemeEntry |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetDoubleValue | Gets the Double value stored within the entry. |
|  | GetElementIdValue | Gets the ElementId value stored within the entry. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetIntegerValue | Gets the Integer value stored within the entry. |
|  | GetStringValue | Gets the String value stored within the entry. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetDoubleValue | Sets new Double value of entry. |
|  | SetElementIdValue | Sets new ElementId value of entry. |
|  | SetIntegerValue | Sets new Integer value of entry. |
|  | SetStringValue | Sets new String value of entry. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace